atrayi/app/controllers/posts_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 0 LIMIT 1
INSERT INTO `posts` (`created_at`, `description`, `title`, `updated_at`, `user_id`) VALUES ('2013-02-02 19:09:43', 'this is my first post!!yahoo!!', 'hello', '2013-02-02 19:09:43', 2)
---
def create
user=User.find(params[:user_id])
post=user.posts.create(params[:post])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1 AND `posts`.`id` = 1 LIMIT 1
---
def show
user =User.find(params[:id])
@posts=user.posts.find(:all)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1 AND `posts`.`id` = 5 LIMIT 1
---
def edit
user=User.find(params[:id])
@posts=user.posts.find(params[:user_id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1 AND `posts`.`id` = 6 LIMIT 1
UPDATE `posts` SET `description` = 'hello!again!', `updated_at` = '2013-02-05 09:32:05' WHERE `posts`.`id` = 6
---
def update
user=User.find(params[:id])
@post=user.posts.find(params[:user_id])
@post.update_attributes(params[:post])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1 AND `posts`.`id` = 6 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 6
---
def destroy
user=User.find(params[:id])
post=user.posts.find(params[:user_id])
post.destroy