atrayi/app/controllers/users_controller.rb

INSERT INTO `users` (`age`, `contact_no`, `created_at`, `dept`, `email`, `name`, `roll`, `updated_at`) VALUES (21, 23445322, '2013-01-31 15:56:32', 'ice', 'atray@gmail.com', 'atrayi', 23, '2013-01-31 15:56:32')
---
def create
	@user=User.create(params[:user])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 1
---
def destroy
	user=User.find(params[:id])
	user.destroy

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
UPDATE `users` SET `name` = 'ashis', `email` = 'suinhk@gmal.com', `dept` = 'cijd', `roll` = 234, `age` = 43, `contact_no` = 473803930, `updated_at` = '2013-02-01 05:34:24' WHERE `users`.`id` = 6
---
def update
	user=User.find(params[:id])
	user.update_attributes(params[:user])